espressif/esp-idf/components/soc/esp32s31/register/soc/interrupt_core0_struct.h
/** Type of lcd_cam_intr_map register
 *  LCD_CAM_INTR mapping register
 */
typedef union {
    struct {
        /** lcd_cam_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t lcd_cam_intr_map:6;
        uint32_t reserved_6:2;
        /** lcd_cam_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t lcd_cam_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core0_lcd_cam_intr_map_reg_t;

/** Type of pwm0_intr_map register
 *  PWM0_INTR mapping register
 */
typedef union {
    struct {
        /** pwm0_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t pwm0_intr_map:6;
        uint32_t reserved_6:2;
        /** pwm0_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t pwm0_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core0_pwm0_intr_map_reg_t;

/** Type of pwm1_intr_map register
 *  PWM1_INTR mapping register
 */
typedef union {
    struct {
        /** pwm1_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t pwm1_intr_map:6;
        uint32_t reserved_6:2;
        /** pwm1_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t pwm1_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core0_pwm1_intr_map_reg_t;

/** Type of pwm2_intr_map register
 *  PWM2_INTR mapping register
 */
typedef union {
    struct {
        /** pwm2_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t pwm2_intr_map:6;
        uint32_t reserved_6:2;
        /** pwm2_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t pwm2_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core0_pwm2_intr_map_reg_t;

/** Type of pwm3_intr_map register
 *  PWM3_INTR mapping register
 */
typedef union {
    struct {
        /** pwm3_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t pwm3_intr_map:6;
        uint32_t reserved_6:2;
        /** pwm3_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t pwm3_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core0_pwm3_intr_map_reg_t;

/** Type of can0_intr_map register
 *  CAN0_INTR mapping register
 */
typedef union {
    struct {
        /** can0_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t can0_intr_map:6;
        uint32_t reserved_6:2;
        /** can0_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t can0_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core0_can0_intr_map_reg_t;

/** Type of can0_timer_intr_map register
 *  CAN0_TIMER_INTR mapping register
 */
typedef union {
    struct {
        /** can0_timer_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t can0_timer_intr_map:6;
        uint32_t reserved_6:2;
        /** can0_timer_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t can0_timer_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core0_can0_timer_intr_map_reg_t;

/** Type of can1_intr_map register
 *  CAN1_INTR mapping register
 */
typedef union {
    struct {
        /** can1_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t can1_intr_map:6;
        uint32_t reserved_6:2;
        /** can1_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t can1_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core0_can1_intr_map_reg_t;

/** Type of can1_timer_intr_map register
 *  CAN1_TIMER_INTR mapping register
 */
typedef union {
    struct {
        /** can1_timer_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t can1_timer_intr_map:6;
        uint32_t reserved_6:2;
        /** can1_timer_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t can1_timer_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core0_can1_timer_intr_map_reg_t;

