espressif/esp-idf/components/soc/esp32s31/register/soc/interrupt_core0_struct.h
/** Type of rmt_intr_map register
 *  RMT_INTR mapping register
 */
typedef union {
    struct {
        /** rmt_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t rmt_intr_map:6;
        uint32_t reserved_6:2;
        /** rmt_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t rmt_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core0_rmt_intr_map_reg_t;

/** Type of i2c0_intr_map register
 *  I2C0_INTR mapping register
 */
typedef union {
    struct {
        /** i2c0_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t i2c0_intr_map:6;
        uint32_t reserved_6:2;
        /** i2c0_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t i2c0_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core0_i2c0_intr_map_reg_t;

/** Type of i2c1_intr_map register
 *  I2C1_INTR mapping register
 */
typedef union {
    struct {
        /** i2c1_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t i2c1_intr_map:6;
        uint32_t reserved_6:2;
        /** i2c1_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t i2c1_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core0_i2c1_intr_map_reg_t;

/** Type of timergrp0_t0_intr_map register
 *  TIMERGRP0_T0_INTR mapping register
 */
typedef union {
    struct {
        /** timergrp0_t0_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t timergrp0_t0_intr_map:6;
        uint32_t reserved_6:2;
        /** timergrp0_t0_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t timergrp0_t0_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core0_timergrp0_t0_intr_map_reg_t;

/** Type of timergrp0_t1_intr_map register
 *  TIMERGRP0_T1_INTR mapping register
 */
typedef union {
    struct {
        /** timergrp0_t1_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t timergrp0_t1_intr_map:6;
        uint32_t reserved_6:2;
        /** timergrp0_t1_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t timergrp0_t1_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core0_timergrp0_t1_intr_map_reg_t;

/** Type of timergrp0_wdt_intr_map register
 *  TIMERGRP0_WDT_INTR mapping register
 */
typedef union {
    struct {
        /** timergrp0_wdt_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t timergrp0_wdt_intr_map:6;
        uint32_t reserved_6:2;
        /** timergrp0_wdt_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t timergrp0_wdt_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core0_timergrp0_wdt_intr_map_reg_t;

/** Type of timergrp1_t0_intr_map register
 *  TIMERGRP1_T0_INTR mapping register
 */
typedef union {
    struct {
        /** timergrp1_t0_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t timergrp1_t0_intr_map:6;
        uint32_t reserved_6:2;
        /** timergrp1_t0_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t timergrp1_t0_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core0_timergrp1_t0_intr_map_reg_t;

/** Type of timergrp1_t1_intr_map register
 *  TIMERGRP1_T1_INTR mapping register
 */
typedef union {
    struct {
        /** timergrp1_t1_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t timergrp1_t1_intr_map:6;
        uint32_t reserved_6:2;
        /** timergrp1_t1_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t timergrp1_t1_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core0_timergrp1_t1_intr_map_reg_t;

