espressif/esp-idf/components/soc/esp32s31/register/soc/interrupt_core0_struct.h
/** Type of ecdsa_intr_map register
 *  ECDSA_INTR mapping register
 */
typedef union {
    struct {
        /** ecdsa_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t ecdsa_intr_map:6;
        uint32_t reserved_6:2;
        /** ecdsa_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t ecdsa_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core0_ecdsa_intr_map_reg_t;

/** Type of km_intr_map register
 *  KM_INTR mapping register
 */
typedef union {
    struct {
        /** km_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t km_intr_map:6;
        uint32_t reserved_6:2;
        /** km_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t km_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core0_km_intr_map_reg_t;

/** Type of rma_intr_map register
 *  RMA_INTR mapping register
 */
typedef union {
    struct {
        /** rma_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t rma_intr_map:6;
        uint32_t reserved_6:2;
        /** rma_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t rma_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core0_rma_intr_map_reg_t;

/** Type of gpio_intr0_map register
 *  GPIO_INTR0 mapping register
 */
typedef union {
    struct {
        /** gpio_intr0_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t gpio_intr0_map:6;
        uint32_t reserved_6:2;
        /** gpio_intr0_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t gpio_intr0_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core0_gpio_intr0_map_reg_t;

/** Type of gpio_intr1_map register
 *  GPIO_INTR1 mapping register
 */
typedef union {
    struct {
        /** gpio_intr1_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t gpio_intr1_map:6;
        uint32_t reserved_6:2;
        /** gpio_intr1_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t gpio_intr1_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core0_gpio_intr1_map_reg_t;

/** Type of gpio_intr2_map register
 *  GPIO_INTR2 mapping register
 */
typedef union {
    struct {
        /** gpio_intr2_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t gpio_intr2_map:6;
        uint32_t reserved_6:2;
        /** gpio_intr2_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t gpio_intr2_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core0_gpio_intr2_map_reg_t;

/** Type of gpio_intr3_map register
 *  GPIO_INTR3 mapping register
 */
typedef union {
    struct {
        /** gpio_intr3_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t gpio_intr3_map:6;
        uint32_t reserved_6:2;
        /** gpio_intr3_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t gpio_intr3_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core0_gpio_intr3_map_reg_t;

/** Type of cpu_intr_from_cpu_0_map register
 *  CPU_INTR_FROM_CPU_0 mapping register
 */
typedef union {
    struct {
        /** cpu_intr_from_cpu_0_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t cpu_intr_from_cpu_0_map:6;
        uint32_t reserved_6:2;
        /** cpu_intr_from_cpu_0_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t cpu_intr_from_cpu_0_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core0_cpu_intr_from_cpu_0_map_reg_t;

/** Type of cpu_intr_from_cpu_1_map register
 *  CPU_INTR_FROM_CPU_1 mapping register
 */
typedef union {
    struct {
        /** cpu_intr_from_cpu_1_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t cpu_intr_from_cpu_1_map:6;
        uint32_t reserved_6:2;
        /** cpu_intr_from_cpu_1_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t cpu_intr_from_cpu_1_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core0_cpu_intr_from_cpu_1_map_reg_t;

