espressif/esp-idf/components/soc/esp32s31/register/soc/interrupt_core0_struct.h
/** Type of hp_peri0_pms_intr_map register
 *  HP_PERI0_PMS_INTR mapping register
 */
typedef union {
    struct {
        /** hp_peri0_pms_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t hp_peri0_pms_intr_map:6;
        uint32_t reserved_6:2;
        /** hp_peri0_pms_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t hp_peri0_pms_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core0_hp_peri0_pms_intr_map_reg_t;

/** Type of hp_peri1_pms_intr_map register
 *  HP_PERI1_PMS_INTR mapping register
 */
typedef union {
    struct {
        /** hp_peri1_pms_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t hp_peri1_pms_intr_map:6;
        uint32_t reserved_6:2;
        /** hp_peri1_pms_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t hp_peri1_pms_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core0_hp_peri1_pms_intr_map_reg_t;

/** Type of cpu0_peri_pms_intr_map register
 *  CPU0_PERI_PMS_INTR mapping register
 */
typedef union {
    struct {
        /** cpu0_peri_pms_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t cpu0_peri_pms_intr_map:6;
        uint32_t reserved_6:2;
        /** cpu0_peri_pms_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t cpu0_peri_pms_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core0_cpu0_peri_pms_intr_map_reg_t;

/** Type of cpu1_peri_pms_intr_map register
 *  CPU1_PERI_PMS_INTR mapping register
 */
typedef union {
    struct {
        /** cpu1_peri_pms_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t cpu1_peri_pms_intr_map:6;
        uint32_t reserved_6:2;
        /** cpu1_peri_pms_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t cpu1_peri_pms_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core0_cpu1_peri_pms_intr_map_reg_t;

/** Type of flash_mspi_intr_map register
 *  FLASH_MSPI_INTR mapping register
 */
typedef union {
    struct {
        /** flash_mspi_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t flash_mspi_intr_map:6;
        uint32_t reserved_6:2;
        /** flash_mspi_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t flash_mspi_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core0_flash_mspi_intr_map_reg_t;

/** Type of lpi_intr_map register
 *  LPI_INTR mapping register
 */
typedef union {
    struct {
        /** lpi_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t lpi_intr_map:6;
        uint32_t reserved_6:2;
        /** lpi_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t lpi_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core0_lpi_intr_map_reg_t;

/** Type of pmt_intr_map register
 *  PMT_INTR mapping register
 */
typedef union {
    struct {
        /** pmt_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t pmt_intr_map:6;
        uint32_t reserved_6:2;
        /** pmt_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t pmt_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core0_pmt_intr_map_reg_t;

/** Type of sbd_intr_map register
 *  SBD_INTR mapping register
 */
typedef union {
    struct {
        /** sbd_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t sbd_intr_map:6;
        uint32_t reserved_6:2;
        /** sbd_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t sbd_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core0_sbd_intr_map_reg_t;

/** Type of usb_otghs_intr_map register
 *  USB_OTGHS_INTR mapping register
 */
typedef union {
    struct {
        /** usb_otghs_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t usb_otghs_intr_map:6;
        uint32_t reserved_6:2;
        /** usb_otghs_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t usb_otghs_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core0_usb_otghs_intr_map_reg_t;

