espressif/esp-idf/components/soc/esp32s31/register/soc/interrupt_core0_struct.h
/** Type of usb_otghs_endp_multi_proc_intr_map register
 *  USB_OTGHS_ENDP_MULTI_PROC_INTR mapping register
 */
typedef union {
    struct {
        /** usb_otghs_endp_multi_proc_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t usb_otghs_endp_multi_proc_intr_map:6;
        uint32_t reserved_6:2;
        /** usb_otghs_endp_multi_proc_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t usb_otghs_endp_multi_proc_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core0_usb_otghs_endp_multi_proc_intr_map_reg_t;

/** Type of jpeg_intr_map register
 *  JPEG_INTR mapping register
 */
typedef union {
    struct {
        /** jpeg_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t jpeg_intr_map:6;
        uint32_t reserved_6:2;
        /** jpeg_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t jpeg_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core0_jpeg_intr_map_reg_t;

/** Type of ppa_intr_map register
 *  PPA_INTR mapping register
 */
typedef union {
    struct {
        /** ppa_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t ppa_intr_map:6;
        uint32_t reserved_6:2;
        /** ppa_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t ppa_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core0_ppa_intr_map_reg_t;

/** Type of core0_trace_intr_map register
 *  CORE0_TRACE_INTR mapping register
 */
typedef union {
    struct {
        /** core0_trace_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t core0_trace_intr_map:6;
        uint32_t reserved_6:2;
        /** core0_trace_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t core0_trace_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core0_core0_trace_intr_map_reg_t;

/** Type of core1_trace_intr_map register
 *  CORE1_TRACE_INTR mapping register
 */
typedef union {
    struct {
        /** core1_trace_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t core1_trace_intr_map:6;
        uint32_t reserved_6:2;
        /** core1_trace_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t core1_trace_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core0_core1_trace_intr_map_reg_t;

/** Type of dma2d_in_ch0_intr_map register
 *  DMA2D_IN_CH0_INTR mapping register
 */
typedef union {
    struct {
        /** dma2d_in_ch0_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t dma2d_in_ch0_intr_map:6;
        uint32_t reserved_6:2;
        /** dma2d_in_ch0_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t dma2d_in_ch0_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core0_dma2d_in_ch0_intr_map_reg_t;

/** Type of dma2d_in_ch1_intr_map register
 *  DMA2D_IN_CH1_INTR mapping register
 */
typedef union {
    struct {
        /** dma2d_in_ch1_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t dma2d_in_ch1_intr_map:6;
        uint32_t reserved_6:2;
        /** dma2d_in_ch1_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t dma2d_in_ch1_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core0_dma2d_in_ch1_intr_map_reg_t;

/** Type of dma2d_in_ch2_intr_map register
 *  DMA2D_IN_CH2_INTR mapping register
 */
typedef union {
    struct {
        /** dma2d_in_ch2_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t dma2d_in_ch2_intr_map:6;
        uint32_t reserved_6:2;
        /** dma2d_in_ch2_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t dma2d_in_ch2_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core0_dma2d_in_ch2_intr_map_reg_t;

/** Type of dma2d_out_ch0_intr_map register
 *  DMA2D_OUT_CH0_INTR mapping register
 */
typedef union {
    struct {
        /** dma2d_out_ch0_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t dma2d_out_ch0_intr_map:6;
        uint32_t reserved_6:2;
        /** dma2d_out_ch0_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t dma2d_out_ch0_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core0_dma2d_out_ch0_intr_map_reg_t;

/** Type of dma2d_out_ch1_intr_map register
 *  DMA2D_OUT_CH1_INTR mapping register
 */
typedef union {
    struct {
        /** dma2d_out_ch1_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t dma2d_out_ch1_intr_map:6;
        uint32_t reserved_6:2;
        /** dma2d_out_ch1_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t dma2d_out_ch1_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core0_dma2d_out_ch1_intr_map_reg_t;

/** Type of dma2d_out_ch2_intr_map register
 *  DMA2D_OUT_CH2_INTR mapping register
 */
typedef union {
    struct {
        /** dma2d_out_ch2_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t dma2d_out_ch2_intr_map:6;
        uint32_t reserved_6:2;
        /** dma2d_out_ch2_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t dma2d_out_ch2_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core0_dma2d_out_ch2_intr_map_reg_t;

/** Type of dma2d_out_ch3_intr_map register
 *  DMA2D_OUT_CH3_INTR mapping register
 */
typedef union {
    struct {
        /** dma2d_out_ch3_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t dma2d_out_ch3_intr_map:6;
        uint32_t reserved_6:2;
        /** dma2d_out_ch3_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t dma2d_out_ch3_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core0_dma2d_out_ch3_intr_map_reg_t;

/** Type of psram_mspi_intr_map register
 *  PSRAM_MSPI_INTR mapping register
 */
typedef union {
    struct {
        /** psram_mspi_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t psram_mspi_intr_map:6;
        uint32_t reserved_6:2;
        /** psram_mspi_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t psram_mspi_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core0_psram_mspi_intr_map_reg_t;

/** Type of hp_sysreg_intr_map register
 *  HP_SYSREG_INTR mapping register
 */
typedef union {
    struct {
        /** hp_sysreg_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t hp_sysreg_intr_map:6;
        uint32_t reserved_6:2;
        /** hp_sysreg_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t hp_sysreg_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core0_hp_sysreg_intr_map_reg_t;

/** Type of pcnt0_intr_map register
 *  PCNT0_INTR mapping register
 */
typedef union {
    struct {
        /** pcnt0_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t pcnt0_intr_map:6;
        uint32_t reserved_6:2;
        /** pcnt0_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t pcnt0_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core0_pcnt0_intr_map_reg_t;

/** Type of pcnt1_intr_map register
 *  PCNT1_INTR mapping register
 */
typedef union {
    struct {
        /** pcnt1_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t pcnt1_intr_map:6;
        uint32_t reserved_6:2;
        /** pcnt1_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t pcnt1_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core0_pcnt1_intr_map_reg_t;

/** Type of hp_pau_intr_map register
 *  HP_PAU_INTR mapping register
 */
typedef union {
    struct {
        /** hp_pau_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t hp_pau_intr_map:6;
        uint32_t reserved_6:2;
        /** hp_pau_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t hp_pau_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core0_hp_pau_intr_map_reg_t;

