espressif/esp-idf/components/soc/esp32s31/register/soc/interrupt_core0_struct.h
/** Type of modem_bt_bb_nmi_intr_map register
 *  MODEM_BT_BB_NMI_INTR mapping register
 */
typedef union {
    struct {
        /** modem_bt_bb_nmi_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t modem_bt_bb_nmi_intr_map:6;
        uint32_t reserved_6:2;
        /** modem_bt_bb_nmi_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t modem_bt_bb_nmi_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core0_modem_bt_bb_nmi_intr_map_reg_t;

/** Type of modem_lp_timer_intr_map register
 *  MODEM_LP_TIMER_INTR mapping register
 */
typedef union {
    struct {
        /** modem_lp_timer_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t modem_lp_timer_intr_map:6;
        uint32_t reserved_6:2;
        /** modem_lp_timer_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t modem_lp_timer_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core0_modem_lp_timer_intr_map_reg_t;

/** Type of modem_coex_intr_map register
 *  MODEM_COEX_INTR mapping register
 */
typedef union {
    struct {
        /** modem_coex_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t modem_coex_intr_map:6;
        uint32_t reserved_6:2;
        /** modem_coex_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t modem_coex_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core0_modem_coex_intr_map_reg_t;

/** Type of modem_ble_timer_intr_map register
 *  MODEM_BLE_TIMER_INTR mapping register
 */
typedef union {
    struct {
        /** modem_ble_timer_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t modem_ble_timer_intr_map:6;
        uint32_t reserved_6:2;
        /** modem_ble_timer_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t modem_ble_timer_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core0_modem_ble_timer_intr_map_reg_t;

/** Type of modem_ble_sec_intr_map register
 *  MODEM_BLE_SEC_INTR mapping register
 */
typedef union {
    struct {
        /** modem_ble_sec_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t modem_ble_sec_intr_map:6;
        uint32_t reserved_6:2;
        /** modem_ble_sec_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t modem_ble_sec_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core0_modem_ble_sec_intr_map_reg_t;

/** Type of modem_i2c_mst_intr_map register
 *  MODEM_I2C_MST_INTR mapping register
 */
typedef union {
    struct {
        /** modem_i2c_mst_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t modem_i2c_mst_intr_map:6;
        uint32_t reserved_6:2;
        /** modem_i2c_mst_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t modem_i2c_mst_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core0_modem_i2c_mst_intr_map_reg_t;

/** Type of modem_zb_mac_intr_map register
 *  MODEM_ZB_MAC_INTR mapping register
 */
typedef union {
    struct {
        /** modem_zb_mac_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t modem_zb_mac_intr_map:6;
        uint32_t reserved_6:2;
        /** modem_zb_mac_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t modem_zb_mac_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core0_modem_zb_mac_intr_map_reg_t;

/** Type of modem_bt_mac_int1_intr_map register
 *  MODEM_BT_MAC_INT1_INTR mapping register
 */
typedef union {
    struct {
        /** modem_bt_mac_int1_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t modem_bt_mac_int1_intr_map:6;
        uint32_t reserved_6:2;
        /** modem_bt_mac_int1_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t modem_bt_mac_int1_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core0_modem_bt_mac_int1_intr_map_reg_t;

