espressif/esp-idf/components/soc/esp32s31/register/soc/interrupt_core0_struct.h
/** Type of cordic_intr_map register
 *  CORDIC_INTR mapping register
 */
typedef union {
    struct {
        /** cordic_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t cordic_intr_map:6;
        uint32_t reserved_6:2;
        /** cordic_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t cordic_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core0_cordic_intr_map_reg_t;

/** Type of zero_det_intr_map register
 *  ZERO_DET_INTR mapping register
 */
typedef union {
    struct {
        /** zero_det_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t zero_det_intr_map:6;
        uint32_t reserved_6:2;
        /** zero_det_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t zero_det_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core0_zero_det_intr_map_reg_t;

/** Type of lp_wdt_intr_map register
 *  LP_WDT_INTR mapping register
 */
typedef union {
    struct {
        /** lp_wdt_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t lp_wdt_intr_map:6;
        uint32_t reserved_6:2;
        /** lp_wdt_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t lp_wdt_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core0_lp_wdt_intr_map_reg_t;

/** Type of lp_timer_reg_0_intr_map register
 *  LP_TIMER_REG_0_INTR mapping register
 */
typedef union {
    struct {
        /** lp_timer_reg_0_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t lp_timer_reg_0_intr_map:6;
        uint32_t reserved_6:2;
        /** lp_timer_reg_0_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t lp_timer_reg_0_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core0_lp_timer_reg_0_intr_map_reg_t;

/** Type of lp_timer_reg_1_intr_map register
 *  LP_TIMER_REG_1_INTR mapping register
 */
typedef union {
    struct {
        /** lp_timer_reg_1_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t lp_timer_reg_1_intr_map:6;
        uint32_t reserved_6:2;
        /** lp_timer_reg_1_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t lp_timer_reg_1_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core0_lp_timer_reg_1_intr_map_reg_t;

/** Type of mb_hp_intr_map register
 *  MB_HP_INTR mapping register
 */
typedef union {
    struct {
        /** mb_hp_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t mb_hp_intr_map:6;
        uint32_t reserved_6:2;
        /** mb_hp_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t mb_hp_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core0_mb_hp_intr_map_reg_t;

/** Type of mb_lp_intr_map register
 *  MB_LP_INTR mapping register
 */
typedef union {
    struct {
        /** mb_lp_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t mb_lp_intr_map:6;
        uint32_t reserved_6:2;
        /** mb_lp_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t mb_lp_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core0_mb_lp_intr_map_reg_t;

/** Type of pmu_reg_0_intr_map register
 *  PMU_REG_0_INTR mapping register
 */
typedef union {
    struct {
        /** pmu_reg_0_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t pmu_reg_0_intr_map:6;
        uint32_t reserved_6:2;
        /** pmu_reg_0_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t pmu_reg_0_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core0_pmu_reg_0_intr_map_reg_t;

