espressif/esp-idf/components/soc/esp32s31/register/soc/interrupt_core0_struct.h
/** Type of lp_ahb_pdma_out_ch0_intr_map register
 *  LP_AHB_PDMA_OUT_CH0_INTR mapping register
 */
typedef union {
    struct {
        /** lp_ahb_pdma_out_ch0_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t lp_ahb_pdma_out_ch0_intr_map:6;
        uint32_t reserved_6:2;
        /** lp_ahb_pdma_out_ch0_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t lp_ahb_pdma_out_ch0_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core0_lp_ahb_pdma_out_ch0_intr_map_reg_t;

/** Type of lp_ahb_pdma_out_ch1_intr_map register
 *  LP_AHB_PDMA_OUT_CH1_INTR mapping register
 */
typedef union {
    struct {
        /** lp_ahb_pdma_out_ch1_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t lp_ahb_pdma_out_ch1_intr_map:6;
        uint32_t reserved_6:2;
        /** lp_ahb_pdma_out_ch1_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t lp_ahb_pdma_out_ch1_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core0_lp_ahb_pdma_out_ch1_intr_map_reg_t;

/** Type of lp_sw_invalid_sleep_intr_map register
 *  LP_SW_INVALID_SLEEP_INTR mapping register
 */
typedef union {
    struct {
        /** lp_sw_invalid_sleep_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t lp_sw_invalid_sleep_intr_map:6;
        uint32_t reserved_6:2;
        /** lp_sw_invalid_sleep_intr_pass_level : R/W; bitpos: [9:8]; default: 0;
         *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
         *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
         *  feature with M-Level.
         */
        uint32_t lp_sw_invalid_sleep_intr_pass_level:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} interrupt_core0_lp_sw_invalid_sleep_intr_map_reg_t;

/** Type of sig_idx_assert_in_sec register
 *  reserved
 */
typedef union {
    struct {
        /** int_sig_idx_assert_in_s : R/W; bitpos: [5:0]; default: 0;
         *  reserved
         */
        uint32_t int_sig_idx_assert_in_s:6;
        /** int_sig_idx_assert_in_m : R/W; bitpos: [11:6]; default: 0;
         *  reserved
         */
        uint32_t int_sig_idx_assert_in_m:6;
        uint32_t reserved_12:20;
    };
    uint32_t val;
} interrupt_core0_sig_idx_assert_in_sec_reg_t;

/** Type of clock_gate register
 *  Interrupt clock gating configure register
 */
typedef union {
    struct {
        /** reg_clk_en : R/W; bitpos: [0]; default: 0;
         *  Interrupt clock gating configure register
         */
        uint32_t reg_clk_en:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} interrupt_core0_clock_gate_reg_t;


/** Group: Status Registers */
/** Type of int_status_reg_0 register
 *  Status register for interrupt sources 0 ~ 31
 */
typedef union {
    struct {
        /** int_status_0 : RO; bitpos: [31:0]; default: 0;
         *  Represents the status of the interrupt sources within interrupt-index-range 0 ~ 31.
         *  Each bit corresponds to one interrupt source
         *  0:The corresponding interrupt source triggered an interrupt
         *  1:No interrupt triggered
         */
        uint32_t int_status_0:32;
    };
    uint32_t val;
} interrupt_core0_int_status_reg_0_reg_t;

/** Type of int_status_reg_1 register
 *  Status register for interrupt sources 32 ~ 63
 */
typedef union {
    struct {
        /** int_status_1 : RO; bitpos: [31:0]; default: 0;
         *  Represents the status of the interrupt sources within interrupt-index-range 32 ~
         *  63. Each bit corresponds to one interrupt source
         *  0:The corresponding interrupt source triggered an interrupt
         *  1:No interrupt triggered
         */
        uint32_t int_status_1:32;
    };
    uint32_t val;
} interrupt_core0_int_status_reg_1_reg_t;

/** Type of int_status_reg_2 register
 *  Status register for interrupt sources 64 ~ 95
 */
typedef union {
    struct {
        /** int_status_2 : RO; bitpos: [31:0]; default: 0;
         *  Represents the status of the interrupt sources within interrupt-index-range 64 ~
         *  95. Each bit corresponds to one interrupt source
         *  0:The corresponding interrupt source triggered an interrupt
         *  1:No interrupt triggered
         */
        uint32_t int_status_2:32;
    };
    uint32_t val;
} interrupt_core0_int_status_reg_2_reg_t;

/** Type of int_status_reg_3 register
 *  Status register for interrupt sources 96 ~ 127
 */
typedef union {
    struct {
        /** int_status_3 : RO; bitpos: [31:0]; default: 0;
         *  Represents the status of the interrupt sources within interrupt-index-range 96 ~
         *  127. Each bit corresponds to one interrupt source
         *  0:The corresponding interrupt source triggered an interrupt
         *  1:No interrupt triggered
         */
        uint32_t int_status_3:32;
    };
    uint32_t val;
} interrupt_core0_int_status_reg_3_reg_t;

/** Type of int_status_reg_4 register
 *  Status register for interrupt sources 128 ~ 159
 */
typedef union {
    struct {
        /** int_status_4 : RO; bitpos: [31:0]; default: 0;
         *  Represents the status of the interrupt sources within interrupt-index-range 128 ~
         *  159. Each bit corresponds to one interrupt source
         *  0:The corresponding interrupt source triggered an interrupt
         *  1:No interrupt triggered
         */
        uint32_t int_status_4:32;
    };
    uint32_t val;
} interrupt_core0_int_status_reg_4_reg_t;

/** Type of int_status_reg_5 register
 *  Status register for interrupt sources 160 ~ 168
 */
typedef union {
    struct {
        /** int_status_5 : RO; bitpos: [8:0]; default: 0;
         *  Represents the status of the interrupt sources within interrupt-index-range 160 ~
         *  168. Each bit corresponds to one interrupt source
         *  0:The corresponding interrupt source triggered an interrupt
         *  1:No interrupt triggered
         */
        uint32_t int_status_5:9;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} interrupt_core0_int_status_reg_5_reg_t;

