espressif/esp-idf/components/soc/esp32s31/register/soc/interrupt_core0_struct.h
/** Type of src_pass_in_s_status_0 register
 *  supervisor-mode PASS_IN status register for interrupt sources 0 ~ 31
 */
typedef union {
    struct {
        /** int_src_pass_in_s_status_0 : RO; bitpos: [31:0]; default: 0;
         *  Represents the supervisor-mode PASS_IN status of the interrupt sources within
         *  interrupt-index-range 0 ~ 31. Each bit corresponds to one interrupt source
         *  0:The corresponding interrupt source is not PASS in supervisor-mode.
         *  1:The corresponding interrupt source is PASS in supervisor-mode.
         */
        uint32_t int_src_pass_in_s_status_0:32;
    };
    uint32_t val;
} interrupt_core0_src_pass_in_s_status_0_reg_t;

/** Type of src_pass_in_s_status_1 register
 *  supervisor-mode PASS_IN status register for interrupt sources 32 ~ 63
 */
typedef union {
    struct {
        /** int_src_pass_in_s_status_1 : RO; bitpos: [31:0]; default: 0;
         *  Represents the supervisor-mode PASS_IN status of the interrupt sources within
         *  interrupt-index-range 32 ~ 63. Each bit corresponds to one interrupt source
         *  0:The corresponding interrupt source is not PASS in supervisor-mode.
         *  1:The corresponding interrupt source is PASS in supervisor-mode.
         */
        uint32_t int_src_pass_in_s_status_1:32;
    };
    uint32_t val;
} interrupt_core0_src_pass_in_s_status_1_reg_t;

/** Type of src_pass_in_s_status_2 register
 *  supervisor-mode PASS_IN status register for interrupt sources 64 ~ 95
 */
typedef union {
    struct {
        /** int_src_pass_in_s_status_2 : RO; bitpos: [31:0]; default: 0;
         *  Represents the supervisor-mode PASS_IN status of the interrupt sources within
         *  interrupt-index-range 64 ~ 95. Each bit corresponds to one interrupt source
         *  0:The corresponding interrupt source is not PASS in supervisor-mode.
         *  1:The corresponding interrupt source is PASS in supervisor-mode.
         */
        uint32_t int_src_pass_in_s_status_2:32;
    };
    uint32_t val;
} interrupt_core0_src_pass_in_s_status_2_reg_t;

/** Type of src_pass_in_s_status_3 register
 *  supervisor-mode PASS_IN status register for interrupt sources 96 ~ 127
 */
typedef union {
    struct {
        /** int_src_pass_in_s_status_3 : RO; bitpos: [31:0]; default: 0;
         *  Represents the supervisor-mode PASS_IN status of the interrupt sources within
         *  interrupt-index-range 96 ~ 127. Each bit corresponds to one interrupt source
         *  0:The corresponding interrupt source is not PASS in supervisor-mode.
         *  1:The corresponding interrupt source is PASS in supervisor-mode.
         */
        uint32_t int_src_pass_in_s_status_3:32;
    };
    uint32_t val;
} interrupt_core0_src_pass_in_s_status_3_reg_t;

/** Type of src_pass_in_s_status_4 register
 *  supervisor-mode PASS_IN status register for interrupt sources 128 ~ 159
 */
typedef union {
    struct {
        /** int_src_pass_in_s_status_4 : RO; bitpos: [31:0]; default: 0;
         *  Represents the supervisor-mode PASS_IN status of the interrupt sources within
         *  interrupt-index-range 128 ~ 159. Each bit corresponds to one interrupt source
         *  0:The corresponding interrupt source is not PASS in supervisor-mode.
         *  1:The corresponding interrupt source is PASS in supervisor-mode.
         */
        uint32_t int_src_pass_in_s_status_4:32;
    };
    uint32_t val;
} interrupt_core0_src_pass_in_s_status_4_reg_t;

/** Type of src_pass_in_s_status_5 register
 *  supervisor-mode PASS_IN status register for interrupt sources 160 ~ 168
 */
typedef union {
    struct {
        /** int_src_pass_in_s_status_5 : RO; bitpos: [8:0]; default: 0;
         *  Represents the supervisor-mode PASS_IN status of the interrupt sources with
         *  interrupt-index-range 160 ~ 168. Each bit corresponds to one interrupt source
         *  0:The corresponding interrupt source is not PASS in supervisor-mode.
         *  1:The corresponding interrupt source is PASS in supervisor-mode.
         */
        uint32_t int_src_pass_in_s_status_5:9;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} interrupt_core0_src_pass_in_s_status_5_reg_t;

/** Type of src_pass_in_m_status_0 register
 *  machine-mode PASS_IN_M status register for interrupt sources 0 ~ 31
 */
typedef union {
    struct {
        /** int_src_pass_in_m_status_0 : RO; bitpos: [31:0]; default: 0;
         *  Represents the machine-mode PASS_IN status of the interrupt sources within
         *  interrupt-index-range 0 ~ 31. Each bit corresponds to one interrupt source
         *  0:The corresponding interrupt source is not PASS in machine-mode.
         *  1:The corresponding interrupt source is PASS in machine-mode.
         */
        uint32_t int_src_pass_in_m_status_0:32;
    };
    uint32_t val;
} interrupt_core0_src_pass_in_m_status_0_reg_t;

/** Type of src_pass_in_m_status_1 register
 *  machine-mode PASS_IN_M status register for interrupt sources 32 ~ 63
 */
typedef union {
    struct {
        /** int_src_pass_in_m_status_1 : RO; bitpos: [31:0]; default: 0;
         *  Represents the machine-mode PASS_IN status of the interrupt sources within
         *  interrupt-index-range 32 ~ 63. Each bit corresponds to one interrupt source
         *  0:The corresponding interrupt source is not PASS in machine-mode.
         *  1:The corresponding interrupt source is PASS in machine-mode.
         */
        uint32_t int_src_pass_in_m_status_1:32;
    };
    uint32_t val;
} interrupt_core0_src_pass_in_m_status_1_reg_t;

/** Type of src_pass_in_m_status_2 register
 *  machine-mode PASS_IN_M status register for interrupt sources 64 ~ 95
 */
typedef union {
    struct {
        /** int_src_pass_in_m_status_2 : RO; bitpos: [31:0]; default: 0;
         *  Represents the machine-mode PASS_IN status of the interrupt sources within
         *  interrupt-index-range 64 ~ 95. Each bit corresponds to one interrupt source
         *  0:The corresponding interrupt source is not PASS in machine-mode.
         *  1:The corresponding interrupt source is PASS in machine-mode.
         */
        uint32_t int_src_pass_in_m_status_2:32;
    };
    uint32_t val;
} interrupt_core0_src_pass_in_m_status_2_reg_t;

/** Type of src_pass_in_m_status_3 register
 *  machine-mode PASS_IN_M status register for interrupt sources 96 ~ 127
 */
typedef union {
    struct {
        /** int_src_pass_in_m_status_3 : RO; bitpos: [31:0]; default: 0;
         *  Represents the machine-mode PASS_IN status of the interrupt sources within
         *  interrupt-index-range 96 ~ 127. Each bit corresponds to one interrupt source
         *  0:The corresponding interrupt source is not PASS in machine-mode.
         *  1:The corresponding interrupt source is PASS in machine-mode.
         */
        uint32_t int_src_pass_in_m_status_3:32;
    };
    uint32_t val;
} interrupt_core0_src_pass_in_m_status_3_reg_t;

/** Type of src_pass_in_m_status_4 register
 *  machine-mode PASS_IN_M status register for interrupt sources 128 ~ 159
 */
typedef union {
    struct {
        /** int_src_pass_in_m_status_4 : RO; bitpos: [31:0]; default: 0;
         *  Represents the machine-mode PASS_IN status of the interrupt sources within
         *  interrupt-index-range 128 ~ 159. Each bit corresponds to one interrupt source
         *  0:The corresponding interrupt source is not PASS in machine-mode.
         *  1:The corresponding interrupt source is PASS in machine-mode.
         */
        uint32_t int_src_pass_in_m_status_4:32;
    };
    uint32_t val;
} interrupt_core0_src_pass_in_m_status_4_reg_t;

